package com.rodiond26.overhellz.otus.basic.lesson20.homework;

public class Homework13 {

    /**
     * Домашнее задание
     * Клиент-серверное приложение "Калькулятор"
     * <p>
     * Цель:
     * научиться работать с сокетами
     * научиться работать с сетью
     * <p>
     * Описание/Пошаговая инструкция выполнения домашнего задания:
     * Сервер: выполняет математические вычисления: +,-,*,/
     * Клиент-серверное взаимодействие:
     * <p>
     * клиент подключается к серверу, получает строку с доступными мат. операциями. Отображает ее пользователю.
     * пользователь вводит два числа и команду в консоль
     * отправляется запрос на сервер, сервер выполняет вычисления, возвращает результат клиенту.
     * клиент отображает результат в консоль
     * <p>
     * Критерии оценки:
     * реализовано клиентское приложение с консольным интерфейсом взаимодействия с пользователем (1 балл)
     * реализовано серверное приложение (3 балла)
     * работа сдана на проверку (1 балл)
     */

    public static void main(String[] args) {


    }
}
