package com.rodiond26.overhellz.otus.basic.lesson11.homework;

public class Task {
//    Домашнее задание
//    ● Создайте классы Cat, Dog и Horse с наследованием от класса Animal
//    ● У каждого животного есть имя, скорость бега и плавания (м/с), и выносливость (измеряется в условных единицах)
//    ● Затраты выносливости:
//      Все животные на 1 метр бега тратят 1 ед выносливости,
//      Собаки на 1 метр плавания - 2 ед.
//      Лошади на 1 метр плавания тратят 4 единицы
//      Кот плавать не умеет.
//    ● Реализуйте методы run(int distance) и swim(int distance), которые должны возвращать время, затраченное на
//      указанное действие, и “понижать выносливость” животного. Если выносливости не хватает, то возвращаем
//      время -1 и указываем что у животного появилось состояние усталости. При выполнении действий пишем
//      сообщения в консоль.
//    ● Добавьте метод info(), который выводит в консоль состояние животного.
}
